{
  "characters": [
    {
      "id": "goku",
      "name": "Son Goku",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/goku-profile-e1616173641804-400x400.png",
      "description": "Es el protagonista del manga y anime Dragon Ball creado por Akira Toriyama. Su nombre proviene de Sun Wukong, un personaje legendario de la novela china Viaje al Oeste, al que Toriyama considera su héroe de la infancia. En un principio se le concibió como un niño con cola de mono, inspirado en el personaje de la leyenda china, pero a medida que avanzaba la trama se le fue haciendo crecer hasta convertirse en un adulto.",
      "link": "https://dragonball.guru/goku/"
    },
    {
      "id": "goten",
      "name": "Son Goten",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/goten-profile-pic-400x400.png",
      "description": "Es el segundo hijo de Goku y Chi-Chi. Tiene muchas similitudes con su padre, con una personalidad optimista y enérgica. Goten es notable por su habilidad para transformarse en Super Saiyan a una edad temprana.",
      "link": "https://dragonball.guru/goten/"
    },
    {
      "id": "krillin",
      "name": "Krillin",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/krillin-profile-1-400x400.png",
      "description": "Krillin es un monje budista y el mejor amigo de Goku. Aunque no es tan fuerte como los Saiyans, su ingenio y lealtad lo convierten en un aliado valioso.",
      "link": "https://dragonball.guru/krillin/"
    },
    {
      "id": "piccolo",
      "name": "Piccolo",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/Piccolo-Profile-Pic-415x415.png",
      "description": "Piccolo es uno de los Namekianos más poderosos y también uno de los personajes más icónicos de la serie. Comienza como un villano pero pronto se convierte en un aliado de Goku y su equipo.",
      "link": "https://dragonball.guru/piccolo/"
    },
    {
      "id": "gohan",
      "name": "Son Gohan",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/toppng.com-mystic-gohan-dragon-ball-z-gohan-1021x2859-1-e1617011806816-400x400.png",
      "description": "Es el primer hijo de Goku y Chi-Chi. A pesar de su amor por la paz y el estudio, Gohan tiene un poder inmenso que incluso supera al de su padre. Su papel en la derrota de Cell es uno de los momentos más memorables de la serie.",
      "link": "https://dragonball.guru/gohan/"
    },
    {
      "id": "vegeta",
      "name": "Vegeta",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/vegeta-profile-400x400.png",
      "description": "El príncipe de los Saiyans, Vegeta es un personaje orgulloso y valiente. Aunque al principio es un enemigo de Goku, se convierte en un aliado y un personaje central en la serie.",
      "link": "https://dragonball.guru/vegeta/"
    },
    {
      "id": "trunks",
      "name": "Trunks (pequeño)",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/Trunks-Profile-Pic.png",
      "description": "Hijo de Vegeta y Bulma, Trunks es un joven Saiyan con un corazón de oro. También es uno de los pocos personajes que pueden transformarse en Super Saiyan a una edad temprana.",
      "link": "https://dragonball.guru/trunks/"
    },
    {
      "id": "frieza",
      "name": "Frieza",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/frieza-profile-e1616174138632-400x400.png",
      "description": "Frieza es uno de los villanos más icónicos de Dragon Ball. Con su despiadada ambición y poderosas transformaciones, Frieza es un enemigo formidable para Goku y los demás.",
      "link": "https://dragonball.guru/frieza/"
    },
    {
      "id": "cell",
      "name": "Cell",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/SeekPng.com_dbz-aura-png_1978081-e1619044254898-400x400.png",
      "description": "Creado por el Dr. Gero para ser el guerrero perfecto, Cell tiene la capacidad de absorber a otros seres para aumentar su propio poder. Su forma perfecta es el resultado de absorber a los androides 17 y 18.",
      "link": "https://dragonball.guru/cell/"
    },
    {
      "id": "boo",
      "name": "Majin Boo",
      "img": "https://dragonball.guru/wp-content/uploads/2021/03/pngarea.com_kid-buu-png-1410072-e1619048346991-400x400.png",
      "description": "Majin Boo es una criatura mágica creada por el mago Bibidi. Aunque comienza como un villano, Boo pasa por varias transformaciones que cambian tanto su personalidad como su apariencia.",
      "link": "https://dragonball.guru/majin-buu/"
    }
  ]
}
